src/InformationRegisters/УдалитьНаборыЗначенийДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>УдалитьНаборыЗначенийДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНабора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоступа</Name>
					<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.УдалитьВидыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеДоступа</Name>
					<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НаборыЗначенийДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НаборыЗначенийДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтандартноеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеБезГрупп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНабора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеДоступа</Name>
					<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уточнение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ДополнительныеЗначенияДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ДополнительныеЗначенияДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоступРазрешен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоступЗапрещен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Например, "ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Comment>Например, "ПланВидовХарактеристик.ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПустойСсылки</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъектаМетаданных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/УдалитьНаборыЗначенийДоступа/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Обработчик обновления информационной базы.
Функция ПереместитьДанныеВНовыйРегистр() Экспорт
	
	ЗапросНаличияДанных = Новый Запрос;
	ЗапросНаличияДанных.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	РегистрСведений.УдалитьНаборыЗначенийДоступа КАК УдалитьНаборыЗначенийДоступа";
	
	Если ЗапросНаличияДанных.Выполнить().Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей() Тогда
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
	КонецЕсли;
	
	ТипыОбъектов = УправлениеДоступомСлужебныйПовтИсп.ТипыОбъектовВПодпискахНаСобытия(
		"ЗаписатьНаборыЗначенийДоступа", Истина);
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ТипыОбъектов", ТипыОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10000
	|	УдалитьНаборыЗначенийДоступа.Объект
	|ИЗ
	|	РегистрСведений.УдалитьНаборыЗначенийДоступа КАК УдалитьНаборыЗначенийДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК Идентификаторы
	|		ПО (ТИПЗНАЧЕНИЯ(УдалитьНаборыЗначенийДоступа.Объект) = ТИПЗНАЧЕНИЯ(Идентификаторы.ЗначениеПустойСсылки))
	|			И (Идентификаторы.ЗначениеПустойСсылки В (&ТипыОбъектов))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборСтарыхЗаписей = СоздатьНаборЗаписей();
	НаборНовыхЗаписей = РегистрыСведений.НаборыЗначенийДоступа.СоздатьНаборЗаписей();
	
	ЗапросПроверки = Новый Запрос;
	ЗапросПроверки.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	РегистрСведений.НаборыЗначенийДоступа КАК НаборыЗначенийДоступа
	|ГДЕ
	|	НаборыЗначенийДоступа.Объект = &Объект";
	
	Пока Выборка.Следующий() Цикл
		НаборСтарыхЗаписей.Отбор.Объект.Установить(Выборка.Объект);
		НаборНовыхЗаписей.Отбор.Объект.Установить(Выборка.Объект);
		ЗапросПроверки.УстановитьПараметр("Объект", Выборка.Объект);
		НаборНовыхЗаписей.Очистить();
		НовыеНаборы = УправлениеДоступом.ТаблицаНаборыЗначенийДоступа();
		
		МетаданныеОбъекта = Выборка.Объект.Метаданные();
		ОбъектСНаборами = МетаданныеОбъекта.ТабличныеЧасти.Найти("НаборыЗначенийДоступа") <> Неопределено;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НаборыЗначенийДоступа");
		ЭлементБлокировки.УстановитьЗначение("Объект", Выборка.Объект);
		Если ОбъектСНаборами Тогда
			ЭлементБлокировки = Блокировка.Добавить(МетаданныеОбъекта.ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Объект);
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			Если ЗапросПроверки.Выполнить().Пустой() Тогда
				НаборСтарыхЗаписей.Прочитать();
				УточнениеЗаполнено = Ложь;
				ЗаполнитьНовыеНаборыОбъекта(НаборСтарыхЗаписей, НовыеНаборы, УточнениеЗаполнено);
				Если УточнениеЗаполнено И ОбъектСНаборами Тогда
					Объект = Выборка.Объект.ПолучитьОбъект();
					Объект.НаборыЗначенийДоступа.Загрузить(НовыеНаборы);
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
				КонецЕсли;
				УправлениеДоступомСлужебный.ПодготовитьНаборыЗначенийДоступаКЗаписи(
					Выборка.Объект, НовыеНаборы, Истина);
				НаборНовыхЗаписей.Загрузить(НовыеНаборы);
				НаборНовыхЗаписей.Записать();
			КонецЕсли;
			НаборСтарыхЗаписей.Очистить();
			НаборСтарыхЗаписей.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
	Если Выборка.Количество() < 10000 Тогда
		
		Если НЕ ЗапросНаличияДанных.Выполнить().Пустой() Тогда
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Записать();
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Управление доступом.Заполнение данных для ограничения доступа'",
				 ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация,
			,
			,
			НСтр("ru = 'Завершен перенос данных из регистра УдалитьНаборыЗначенийДоступа.'"),
			РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
	Иначе
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Управление доступом.Заполнение данных для ограничения доступа'",
				 ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация,
			,
			,
			НСтр("ru = 'Выполнен шаг переноса данных из регистра УдалитьНаборыЗначенийДоступа.'"),
			РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗаполнитьНовыеНаборыОбъекта(СтарыеЗаписи, НовыеНаборы, УточнениеЗаполнено)
	
	ДействующиеНаборы = Новый Соответствие;
	
	Для каждого СтараяСтрока Из СтарыеЗаписи Цикл
		Если СтараяСтрока.Чтение Или СтараяСтрока.Изменение Тогда
			ДействующиеНаборы.Вставить(СтараяСтрока.НомерНабора, Истина);
		КонецЕсли;
	КонецЦикла;
	
	ВозможныеПрава = УправлениеДоступомСлужебныйПовтИсп.ВозможныеПраваДляНастройкиПравОбъектов();
	ТипыВладельцевНастроекПрав = ВозможныеПрава.ПоТипамСсылок;
	
	Для каждого СтараяСтрока Из СтарыеЗаписи Цикл
		Если ДействующиеНаборы.Получить(СтараяСтрока.НомерНабора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = НовыеНаборы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтараяСтрока, "НомерНабора, ЗначениеДоступа, Чтение, Изменение");
		
		Если СтараяСтрока.ВидДоступа = ПланыВидовХарактеристик.УдалитьВидыДоступа.ПустаяСсылка() Тогда
			Если СтараяСтрока.ЗначениеДоступа = Неопределено Тогда
				НоваяСтрока.ЗначениеДоступа = Перечисления.ДополнительныеЗначенияДоступа.ДоступЗапрещен;
			Иначе
				НоваяСтрока.ЗначениеДоступа = Перечисления.ДополнительныеЗначенияДоступа.ДоступРазрешен;
			КонецЕсли;
		
		ИначеЕсли СтараяСтрока.ВидДоступа = ПланыВидовХарактеристик.УдалитьВидыДоступа.ПравоЧтения
		      ИЛИ СтараяСтрока.ВидДоступа = ПланыВидовХарактеристик.УдалитьВидыДоступа.ПравоИзменения
		      ИЛИ СтараяСтрока.ВидДоступа = ПланыВидовХарактеристик.УдалитьВидыДоступа.ПравоДобавления Тогда
			
			Если ТипЗнч(СтараяСтрока.ЗначениеДоступа) <> Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
				Если Метаданные.НайтиПоТипу(ТипЗнч(СтараяСтрока.ЗначениеДоступа)) = Неопределено Тогда
					НоваяСтрока.ЗначениеДоступа = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
				Иначе
					НоваяСтрока.ЗначениеДоступа =
						ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(СтараяСтрока.ЗначениеДоступа));
				КонецЕсли;
			КонецЕсли;
			
			Если СтараяСтрока.ВидДоступа = ПланыВидовХарактеристик.УдалитьВидыДоступа.ПравоЧтения Тогда
				НоваяСтрока.Уточнение = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
			Иначе
				НоваяСтрока.Уточнение = НоваяСтрока.ЗначениеДоступа;
			КонецЕсли;
			
		ИначеЕсли ТипыВладельцевНастроекПрав.Получить(ТипЗнч(СтараяСтрока.ЗначениеДоступа)) <> Неопределено Тогда
			
			НоваяСтрока.Уточнение = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(СтараяСтрока.Объект));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Уточнение) Тогда
			УточнениеЗаполнено = Истина;
		КонецЕсли;
	КонецЦикла;
	
	УправлениеДоступом.ДобавитьНаборыЗначенийДоступа(
		НовыеНаборы, УправлениеДоступом.ТаблицаНаборыЗначенийДоступа(), Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
